/**
 * Created by Jeffrey on 2/13/15.
 */

$(function () {
    $('#scatter-container').highcharts({
        title: {
            text: ''
        },
        xAxis: {
            title: {
                text: '日均单量'
            },
            min: 0
        },
        yAxis: {
            title: {
                text: '日均出勤人数'
            },
            min: 0
        },
        credits: {
            href: "http://www.cpscs.cc/",
            text: "www.cpscs.cc"
        },
        labels: {
            items: [{
                html: '标准运能(50单/人天)',
                style: {
                    left: '50px',
                    top: '18px',
                    color: (Highcharts.theme && Highcharts.theme.textColor) || 'black'
                }
            }]
        },
        tooltip: {
            headerFormat: '',
            formatter: function () {
                return '<b>' + this.point.name + '</b><br/>' + '日均单量: ' + this.x + '<br/>' +
                    '日均出勤人数: ' + this.y + '<br>运能: '+ this.point.z;
            }
        },
        series: [{
            type: 'line',
            name: '标准运能',
            color: Highcharts.getOptions().colors[3],
            data: [[0, 0], [200, 4]],
            marker: {
                enabled: false
            },
            states: {
                hover: {
                    lineWidth: 0
                }
            },
            enableMouseTracking: false
        }, {
            type: 'scatter',
            name: '揽投站',
            color: Highcharts.getOptions().colors[0],
            data: [{x: 127.17, y: 2.75, z: 46.28, name: '北京市海淀区邮电局四王府邮电所'},{x: 5.32, y: 0.09, z: 58.35, name: '北京市海淀区邮电局北京科技大学邮电所'},{x: 13.93, y: 0.25, z: 55.99, name: '北京市海淀区邮电局林业大学邮电所'},{x: 66.34, y: 1.77, z: 37.38, name: '北京市海淀区邮电局北京航空学院邮政所'},{x: 67.09, y: 1.56, z: 43.01, name: '北京市海淀区邮电局北安河邮电所'},{x: 101.65, y: 2.68, z: 37.91, name: '北京市海淀区中央党校邮政所'},{x: 99.17, y: 2.86, z: 34.69, name: '北京市海淀区邮电局玉泉山邮电所'},{x: 103.28, y: 2.32, z: 44.60, name: '北京市海淀区邮电局新型材料厂邮政所'},{x: 125.41, y: 2.40, z: 52.29, name: '北京市海淀区邮电局清河镇邮局'},{x: 154.97, y: 3.40, z: 45.54, name: '北京市海淀区邮电局师范大学邮政所'},{x: 77.08, y: 1.30, z: 59.47, name: '北京市海淀区邮电局空研大院邮电所'},{x: 197.30, y: 5.06, z: 39.02, name: '北京市海淀区邮电局中关村东路邮电所'},{x: 85.84, y: 2.58, z: 33.27, name: '北京市海淀区邮电局苏州街邮局'},{x: 15.25, y: 0.49, z: 30.90, name: '北京市海淀区邮电局中央民族大学邮电所'},{x: 114.64, y: 2.92, z: 39.24, name: '北京市海淀区大钟寺邮市邮电所'},{x: 136.30, y: 3.46, z: 39.42, name: '北京市海淀区邮电局人民大学邮政所'},{x: 96.51, y: 2.02, z: 47.76, name: '北京市海淀区邮电局北京医科大学邮政所'},{x: 192.22, y: 6.24, z: 30.81, name: '北京市海淀区邮电局双泉堡邮政所'},{x: 159.99, y: 3.51, z: 45.64, name: '北京市海淀区邮电局邮票公司'},{x: 107.17, y: 1.99, z: 53.89, name: '北京市海淀区邮电局清华大学邮局'},{x: 86.33, y: 1.65, z: 52.20, name: '北京市海淀区邮电局学院路邮局'},{x: 26.41, y: 0.81, z: 32.66, name: '北京市海淀区邮电局温泉邮局'},{x: 112.06, y: 2.59, z: 43.25, name: '北京市海淀区邮电局厢红旗邮电所'},{x: 171.99, y: 5.55, z: 31.01, name: '北京市海淀区邮电局海淀区速递局'},{x: 132.86, y: 2.28, z: 58.25, name: '北京市海淀区邮电局科东南邮政所'},{x: 116.37, y: 2.39, z: 48.67, name: '北京市海淀区邮电局车道沟邮政所'},{x: 113.59, y: 3.73, z: 30.43, name: '北京市海淀区邮电局龙乡邮政所'},{x: 166.42, y: 2.98, z: 55.83, name: '北京市海淀区邮电局香山邮局'},{x: 47.86, y: 0.80, z: 59.47, name: '北京市海淀区邮电局农机研究学院邮电所'},{x: 186.00, y: 4.77, z: 38.98, name: '北京市海淀区邮电局北极寺邮政所'},{x: 76.66, y: 1.31, z: 58.57, name: '北京市海淀区邮电局牡丹东里邮电所'},{x: 199.59, y: 4.15, z: 48.15, name: '北京市海淀区邮政局青龙桥邮政所'},{x: 70.53, y: 2.26, z: 31.15, name: '北京市海淀区邮电局双榆树邮局'},{x: 74.28, y: 1.48, z: 50.24, name: '北京市海淀区邮电局北太平庄邮局'},{x: 82.15, y: 1.52, z: 54.04, name: '北京市海淀区邮电局西大街邮政所'},{x: 153.24, y: 2.99, z: 51.33, name: '北京市海淀区邮电局罗庄邮电所'},{x: 196.70, y: 3.51, z: 56.01, name: '北京市海淀区邮电局中关村邮电局'},{x: 173.27, y: 5.54, z: 31.30, name: '北京市海淀区邮电局魏公村邮电局'},{x: 14.34, y: 0.39, z: 36.60, name: '北京市海淀区邮电局金五星商城邮电所'},{x: 49.58, y: 1.07, z: 46.33, name: '北京市海淀区邮电局红旗村邮政所'},{x: 96.51, y: 1.76, z: 54.95, name: '北京市海淀区邮电局邮电大学邮电所'},{x: 70.13, y: 1.34, z: 52.30, name: '北京市海淀区邮电局空军指挥学院邮政所'},{x: 52.20, y: 0.87, z: 59.72, name: '北京市海淀区邮电局科学院邮政所'},{x: 52.13, y: 1.03, z: 50.69, name: '北京市海淀区邮电局四道口邮政所'},{x: 48.65, y: 0.99, z: 48.96, name: '北京市海淀区邮电局国防大学邮政所'},{x: 24.28, y: 0.43, z: 56.94, name: '北京市海淀区邮电局苏家坨邮政所'},{x: 153.33, y: 3.77, z: 40.65, name: '北京市海淀区邮电局颐和山庄邮电所'},{x: 69.49, y: 1.95, z: 35.68, name: '北京市海淀区邮电局育新南区邮电所'},{x: 90.19, y: 1.59, z: 56.87, name: '北京市海淀区邮电局永泰邮电所'},{x: 191.11, y: 3.94, z: 48.55, name: '北京市海淀区邮电局农业大学邮政所'},{x: 146.01, y: 3.94, z: 37.06, name: '北京市海淀区邮电局安宁里邮电所'},{x: 88.37, y: 1.60, z: 55.16, name: '北京市海淀区邮电局体育学院邮电所'},{x: 122.39, y: 2.45, z: 49.86, name: '北京市海淀区邮电局西苑邮电所'},{x: 195.62, y: 3.65, z: 53.53, name: '北京市海淀区邮电局文慧园邮电所'},{x: 196.72, y: 5.91, z: 33.27, name: '北京市海淀区邮电局西北旺邮局'},{x: 197.83, y: 3.72, z: 53.23, name: '北京市海淀区邮电局育新花园邮电局'},{x: 139.46, y: 4.06, z: 34.31, name: '北京市海淀区邮政局颐和园邮局'},{x: 166.99, y: 3.02, z: 55.28, name: '北京市海淀区邮电局二里庄邮电所'},{x: 37.16, y: 1.23, z: 30.29, name: '北京市海淀区邮电局友谊宾馆邮政所'},{x: 13.53, y: 0.30, z: 45.68, name: '北京市海淀区邮电局兰靛厂邮政所'},{x: 52.58, y: 1.08, z: 48.76, name: '北京市海淀区邮电局北京大学邮政所'},{x: 7.88, y: 0.19, z: 40.79, name: '北京市海淀区邮电局理工大学邮电所'},{x: 10.59, y: 0.24, z: 44.29, name: '北京市海淀区邮电局冷泉邮政所'},{x: 53.63, y: 1.02, z: 52.77, name: '北京市海淀区建安西路邮电所'}
            ],
            marker: {
                radius: 4
            }
        }]
    });
});
